In [13]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
%matplotlib inline

In [14]:
train = pd.read_csv('data/train.csv')

//anaconda/lib/python3.5/site-packages/IPython/core/interactiveshell.py:2902: DtypeWarning: Columns (5) have mixed types. Specify dtype option on import or set low_memory=False.
  interactivity=interactivity, compiler=compiler, result=result)

In [16]:
train.head(5)

   id        date  store_nbr  item_nbr  unit_sales onpromotion
0   0  2013-01-01         25    103665         7.0         NaN
1   1  2013-01-01         25    105574         1.0         NaN
2   2  2013-01-01         25    105575         2.0         NaN
3   3  2013-01-01         25    108079         1.0         NaN
4   4  2013-01-01         25    108701         1.0         NaN

In [17]:
test = pd.read_csv('data/test.csv')
test.sample(5)

                id        date  store_nbr  item_nbr  onpromotion
2931045  128428085  2017-08-29         50   1040348        False
233540   125730580  2017-08-17          6   2005984        False
2171631  127668671  2017-08-26         17   1501547        False
911636   126408676  2017-08-20         18   1575231        False
471495   125968535  2017-08-18         13   2005298         True

In [19]:
holiday_events = pd.read_csv('data/holidays_events.csv')
holiday_events.head()

,date,type,locale,locale_name,description,transferred
0,2012-03-02,Holiday,Local,Manta,Fundacion de Manta,False
1,2012-04-01,Holiday,Regional,Cotopaxi,Provincializacion de Cotopaxi,False
2,2012-04-12,Holiday,Local,Cuenca,Fundacion de Cuenca,False
3,2012-04-14,Holiday,Local,Libertad,Cantonizacion de Libertad,False
4,2012-04-21,Holiday,Local,Riobamba,Cantonizacion de Riobamba,False

In [20]:
item = pd.read_csv("data/items.csv")
item.head()

   item_nbr        family  class  perishable
0     96995     GROCERY I   1093           0
1     99197     GROCERY I   1067           0
2    103501      CLEANING   3008           0
3    103520     GROCERY I   1028           0
4    103665  BREAD/BAKERY   2712           1

In [21]:
oil = pd.read_csv('data/oil.csv')
oil.head()

         date  dcoilwtico
0  2013-01-01         NaN
1  2013-01-02       93.14
2  2013-01-03       92.97
3  2013-01-04       93.12
4  2013-01-07       93.20

In [24]:
stores = pd.read_csv('data/stores.csv')
stores.sample(5)

    store_nbr       city      state type  cluster
48         49      Quito  Pichincha    A       11
0           1      Quito  Pichincha    D       13
27         28  Guayaquil     Guayas    E       10
31         32  Guayaquil     Guayas    C        3
46         47      Quito  Pichincha    A       14

In [25]:
transactions = pd.read_csv('data/transactions.csv')
transactions.head()

         date  store_nbr  transactions
0  2013-01-01         25           770
1  2013-01-02          1          2111
2  2013-01-02          2          2358
3  2013-01-02          3          3487
4  2013-01-02          4          1922

Transactions:交易

In [27]:
sample_submission = pd.read_csv('data/sample_submission.csv')
sample_submission.head()

          id  unit_sales
0  125497040           0
1  125497041           0
2  125497042           0
3  125497043           0
4  125497044           0